app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 6) LIMIT 1
---
  def index
    @users = User.find(:all)

INSERT INTO `users` (`salt`, `updated_at`, `crypted_password`, `remember_token_expires_at`, `remember_token`, `login`, `email`, `created_at`) VALUES('0620755b05a718f51060f96460531f6b48e9781a', '2009-11-23 10:07:12', 'bfe304a3d7073c5fd817e529e1821481bb76981f', NULL, NULL, 'admin123', 'dfdfdf', '2009-11-23 10:07:12')
---
  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save

SELECT * FROM `users` WHERE (`users`.`login` IS NULL) LIMIT 1
---
  def login_available_check
    @user = User.find_by_login(params[:login_name])

SELECT * FROM `users` WHERE (`users`.`email` IS NULL) LIMIT 1
---
  def email_available_check
    @vaild_user = User.find_by_email(params[:email])

SELECT * FROM `users` WHERE (`users`.`id` = 3)
UPDATE `users` SET `login` = 'admin123321', `crypted_password` = '64ce515e72bf688fb8b14c025c6f0d33426195e0', `email` = 'dfdfdf@asdsdsd.com', `updated_at` = '2009-11-23 11:49:03' WHERE `id` = 1
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])

SELECT * FROM `users` WHERE (`users`.`id` = 1)
DELETE FROM `users` WHERE `id` = 1
---
  def destroy
    @video = User.find(params[:id])
    @video.destroy